app/serializers/user_serializer.rb

  def user
    {
      id: object.id,
      first_name: object.first_name,
      last_name: object.last_name,
      email: object.email,
      restaurants: parse_restaurants(object.restaurants)
---
SELECT "restaurants".* FROM "restaurants" INNER JOIN "favourites" ON "restaurants"."id" = "favourites"."restaurant_id" WHERE "favourites"."user_id" = ?  [["user_id", 1]]