app/controllers/application_controller.rb

    def get_user
      # Decode the token and pull out the user's id from it
      id = decode_token["id"]
      # Attempt to find and return the user with that id, otherwise, this will return nil
      User.find_by(id: id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]