app/controllers/favourites_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "testing"], ["LIMIT", 1]]
SELECT "favourites".* FROM "favourites" WHERE "favourites"."user_id" = ? AND "favourites"."restaurant_id" = ? LIMIT ?  [["user_id", 5], ["restaurant_id", 9], ["LIMIT", 1]]
DELETE FROM "favourites" WHERE "favourites"."id" = ?  [["id", 8]]
---
def unfavourite
    restaurant = params[:restaurant]
    user = User.find_by(username: params[:user])
    favourite = Favourite.find_by({user_id: user.id, restaurant_id: restaurant[:id]})
    favourite.destroy