app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
    def show
        restaurant = Restaurant.find(params[:id])

SELECT "restaurants".* FROM "restaurants"
---
    def index
        restaurants = Restaurant.all

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."zomato_id" = ? LIMIT ?  [["zomato_id", 6117406], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "testing"], ["LIMIT", 1]]
INSERT INTO "restaurants" ("name", "cuisine", "picture", "zomato_id", "longitude", "latitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "favourites" ("user_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["restaurant_id", 14], ["created_at", "2020-03-26 13:46:25.143985"], ["updated_at", "2020-03-26 13:46:25.143985"]]
INSERT INTO "favourites" ("user_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["restaurant_id", 14], ["created_at", "2020-03-26 13:42:02.567834"], ["updated_at", "2020-03-26 13:42:02.567834"]]
---
    def create
      restaurant = Restaurant.find_by(zomato_id: params[:zomato_id])
      user = User.find_by(username: params[:user])
      if restaurant && user
        Favourite.create(user_id: user.id, restaurant_id: restaurant.id)
        render json: {restaurant: restaurant}
      else
        new_restaurant = Restaurant.new(
            name: params[:name],
            cuisine: params[:cuisine],
            picture: params[:picture],
            zomato_id: params[:zomato_id],
            longitude: params[:longitude],
            latitude: params[:latitude])

         if new_restaurant.save && user
            Favourite.create(user_id: user.id, restaurant_id: new_restaurant.id)