app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "samkipper"], ["LIMIT", 1]]
---
    def sign_in
        user = User.find_by(username: params[:username])

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)
---
      def create
        @user = User.new(first_name: params[:first_name], last_name: params[:last_name], email: params[:email], username: params[:username],password: params[:password])

        if @user.save